_Carregando ambiente Jupyter Notebook_

In [ ]:
%load_ext sql

In [3]:
%sql SET search_path TO vendas;

 * postgresql://postgres:***@localhost:5432/banco
Done.

[]

In [2]:
%sql postgresql://postgres:postgres@localhost:5432/banco

# Exercícios

## 1. Inserir Dados na tabela Pedido e Item

- Leandro Fonseca fez a compra de:
- 2 Vestidos Fabula no dia 01-10-2023;
- O status dos pedidos é “Recebido”.

In [75]:
%%sql 
select * from produtos order by 1 offset 15;

 * postgresql://postgres:***@localhost:5432/banco
7 rows affected.

[(16, 'Vestido Longo Floral', 'Vestido leve e ideal para o verão', 197.89000000000001, 3),
 (17, 'Notebook Gamer Pro', 'Máquina poderosa com RTX 4060 e 32GB RAM', 8798.900000000001, 1),
 (18, 'Pacote de Viagem - Europa', 'Passagem + hospedagem em 3 países por 10 dias', 9898.900000000001, 10),
 (19, 'Jaqueta Corta-Vento', 'Ideal para dias frios e chuvosos', 274.89000000000004, 3),
 (20, 'Curso de Marketing Digital', 'Aprenda estratégias de tráfego e SEO', 328.90000000000003, 5),
 (21, 'Vestido Fabulo', 'Vestido Infantil Para Festas', 253.00000000000003, 3),
 (22, 'Vestido Infantil Encanto', 'Vestido Infantil Para Eventos', 242.00000000000003, 3)]

In [ ]:
%%sql
insert into clientes (nome, email, telefone, cpf) values 
    ('Leandro Fonseca', 'leandro.fonseca@email.com', 11922332233, 23412312123); -- 32
insert into produtos (nome, preco, id_categoria) values 
    ('Vestido Fabulo', 230.0, 3); -- 21
insert into pedidos (id_cliente, data_pedido, status)
    values (32, '2023-10-01', 'pago'); -- 21
insert into itens_pedido (id_pedido, id_produto, quantidade, preco_unitario) values 
    (21, 21, 2, 230.0)
update produtos set descricao = 'Vestido feminino para festas' where id_produto = 21;
select * from itens_pedido;
select * from pedidos;
select * from produtos;

 * postgresql://postgres:***@localhost:5432/banco
1 rows affected.

[]

## 2. Inserir os dados na tabela Clientes, Pedidos e ItensPedido

Um novo cliente fez a compra de: 

- 2 Vestidos Infantil Encanto no dia 15-12-2023;
- O status dos pedidos é “Recebido”.
- Dados do Novo Cliente:
- Nome: ‘Luciano Huck’
- Telefone: 219998999
- email: luciano_huck@globo.com
- endereço: Rua 9, 59
- cpf: 11199988877

In [28]:
%%sql
insert into produtos (nome, descricao, preco, id_categoria) values
    ('Vestido Infantil Encanto', 'Vestido infantil para festas', 220.0, 3); -- 21
insert into clientes (nome, email, telefone, cpf) values 
    ('Luciano Huck', 'luciano_huck@globo.com', 21999899999,11199988877); -- 33
insert into pedidos (id_cliente, data_pedido, status) values
    (33, '2023-12-15', 'pago'); -- 22
insert into itens_pedido 
    (id_pedido, id_produto, quantidade, preco_unitario) values
    (22, 21, 2, 220.0);
select * from clientes;
select * from produtos where descricao like 'Vestido%';
select * from pedidos;
select i.id_item_pedido, i.quantidade, pr.id_produto, pr.nome, p.data_pedido, p.status, c.nome, c.telefone, c.email, c.cpf
    from clientes c
    inner join pedidos p on c.id_cliente = p.id_cliente
    left join itens_pedido i on i.id_pedido = p.id_pedido
    left join produtos pr on pr.id_produto = i.id_produto
    where p.id_pedido = 22;

 * postgresql://postgres:***@localhost:5432/banco
32 rows affected.
3 rows affected.
22 rows affected.
1 rows affected.

[(18, 2, 22, 'Vestido Infantil Encanto', datetime.date(2023, 12, 15), 'pago', 'Luciano Huck', 21999899999, 'luciano_huck@globo.com', '11199988877')]

## 3. Atualizar a coluna Telefone

Altere a tabela Cliente com uma nova coluna para armazenar o DDD do 
telefone.
- Incluir nova coluna “DDD” na tabela Cliente (ALTER TABLE):
- Atualizar a coluna DDD de todos os clientes com base nos 2 primeiros dígitos da 
coluna telefone;
- Remover os 2 primeiros dígitos da coluna telefone.
Dicas:
- Fórmula CAST(<int> AS <datatype>);
- Fórmula SUBSTR(<string>, 1,2);

In [30]:
%%sql
-- listando clientes
select * from clientes limit 5;

 * postgresql://postgres:***@localhost:5432/banco
5 rows affected.

[(1, 'João Silva', 'joao.silva@email.com', 11987654321, '12345678901'),
 (2, 'Maria Oliveira', 'maria.oliveira@email.com', 21998765432, '23456789012'),
 (3, 'Carlos Souza', 'carlos.souza@email.com', 31991234567, '34567890123'),
 (4, 'Ana Paula', 'ana.paula@email.com', 41999887766, '45678901234'),
 (5, 'Fernanda Lima', 'fernanda.lima@email.com', 51993456789, '56789012345')]

In [34]:
%%sql 
-- adicionando nova coluna ddd
alter table clientes add column ddd char(2);
select * from clientes limit 5;

 * postgresql://postgres:***@localhost:5432/banco
5 rows affected.

[(1, 'João Silva', 'joao.silva@email.com', 11987654321, '12345678901', None),
 (2, 'Maria Oliveira', 'maria.oliveira@email.com', 21998765432, '23456789012', None),
 (3, 'Carlos Souza', 'carlos.souza@email.com', 31991234567, '34567890123', None),
 (4, 'Ana Paula', 'ana.paula@email.com', 41999887766, '45678901234', None),
 (5, 'Fernanda Lima', 'fernanda.lima@email.com', 51993456789, '56789012345', None)]

In [38]:
%%sql 
-- atualizando a coluna ddd
update clientes set ddd = substr(cast(telefone as text), 1, 2);
select * from clientes limit 5;

 * postgresql://postgres:***@localhost:5432/banco
32 rows affected.
5 rows affected.

[(1, 'João Silva', 'joao.silva@email.com', 11987654321, '12345678901', '11'),
 (2, 'Maria Oliveira', 'maria.oliveira@email.com', 21998765432, '23456789012', '21'),
 (3, 'Carlos Souza', 'carlos.souza@email.com', 31991234567, '34567890123', '31'),
 (4, 'Ana Paula', 'ana.paula@email.com', 41999887766, '45678901234', '41'),
 (5, 'Fernanda Lima', 'fernanda.lima@email.com', 51993456789, '56789012345', '51')]

In [43]:
%%sql
-- atualizando a coluna telefone
update clientes set telefone = cast(substr(cast(telefone as text), 3) as bigint);
select * from clientes limit 5;

 * postgresql://postgres:***@localhost:5432/banco
5 rows affected.

[(1, 'João Silva', 'joao.silva@email.com', 987654321, '12345678901', '11'),
 (2, 'Maria Oliveira', 'maria.oliveira@email.com', 998765432, '23456789012', '21'),
 (3, 'Carlos Souza', 'carlos.souza@email.com', 991234567, '34567890123', '31'),
 (4, 'Ana Paula', 'ana.paula@email.com', 999887766, '45678901234', '41'),
 (5, 'Fernanda Lima', 'fernanda.lima@email.com', 993456789, '56789012345', '51')]

## 4. Atualizar Preço dos Produtos

Atualize os dados da coluna preco da tabela Produtos da seguinte forma:
- Aplicar um aumento de 10% no Preço dos Produtos;
- Alterar a data do pedido 1 para 2025-02-01.
- Alterar a data do pedido 2 para 2025-02-15.

In [46]:
%%sql
-- listando os produtos
select * from produtos limit 5;

 * postgresql://postgres:***@localhost:5432/banco
5 rows affected.

[(1, 'Notebook Ultrafino', 'Notebook leve com 16GB RAM e SSD 512GB', 4399.9, 1),
 (2, 'Smartphone X20', 'Smartphone com câmera tripla e 128GB de memória', 2999.0, 1),
 (3, 'Camiseta Estampada', 'Camiseta de algodão com estampa moderna', 59.9, 3),
 (4, 'Suplemento Whey Protein', 'Proteína concentrada para ganho de massa muscular', 149.99, 4),
 (5, 'Curso de Python', 'Curso online para aprender programação em Python', 199.0, 5)]

In [49]:
%%sql
-- aplicando o aumento de 10% nos precos
update produtos set preco = preco * 1.1;
select * from produtos limit 5;

 * postgresql://postgres:***@localhost:5432/banco
5 rows affected.

[(1, 'Notebook Ultrafino', 'Notebook leve com 16GB RAM e SSD 512GB', 4839.89, 1),
 (2, 'Smartphone X20', 'Smartphone com câmera tripla e 128GB de memória', 3298.9, 1),
 (3, 'Camiseta Estampada', 'Camiseta de algodão com estampa moderna', 65.89, 3),
 (4, 'Suplemento Whey Protein', 'Proteína concentrada para ganho de massa muscular', 164.98900000000003, 4),
 (5, 'Curso de Python', 'Curso online para aprender programação em Python', 218.9, 5)]

In [45]:
%%sql
-- listando registros de pedidos
select * from pedidos limit 2;

 * postgresql://postgres:***@localhost:5432/banco
2 rows affected.

[(1, 1, datetime.date(2024, 12, 1), 'pago'),
 (2, 2, datetime.date(2024, 12, 3), 'pago')]

In [51]:
%%sql 
-- atualizando a data do pedido 1
update pedidos set data_pedido = '2025-02-01' where id_pedido = 1;
-- atualizando a data do pedido 2
update pedidos set data_pedido = '2025-02-15' where id_pedido = 2;
select * from pedidos order by id_pedido limit 5;

 * postgresql://postgres:***@localhost:5432/banco
5 rows affected.

[(1, 1, datetime.date(2025, 2, 1), 'pago'),
 (2, 2, datetime.date(2025, 2, 15), 'pago'),
 (3, 3, datetime.date(2024, 12, 5), 'pendente'),
 (4, 4, datetime.date(2024, 12, 7), 'cancelado'),
 (5, 5, datetime.date(2024, 12, 10), 'pago')]

## 5. Combinar dados Pedidos e Clientes
Liste todos os pedidos com informações do cliente, exibindo:

- nome do cliente; 
- email; 
- status do pedido

In [56]:
%%sql
select distinct c.nome, c.email, p.status from pedidos p 
inner join clientes c on p.id_cliente = c.id_cliente
order by 1;

 * postgresql://postgres:***@localhost:5432/banco
19 rows affected.

[('Ana Paula', 'ana.paula@email.com', 'cancelado'),
 ('Ana Paula', 'ana.paula@email.com', 'pago'),
 ('Beatriz Nunes', 'beatriz.nunes@email.com', 'cancelado'),
 ('Beatriz Nunes', 'beatriz.nunes@email.com', 'pendente'),
 ('Carlos Souza', 'carlos.souza@email.com', 'pago'),
 ('Carlos Souza', 'carlos.souza@email.com', 'pendente'),
 ('Eduardo Ferreira', 'eduardo.ferreira@email.com', 'pago'),
 ('Fernanda Lima', 'fernanda.lima@email.com', 'cancelado'),
 ('Fernanda Lima', 'fernanda.lima@email.com', 'pago'),
 ('João Silva', 'joao.silva@email.com', 'pago'),
 ('João Silva', 'joao.silva@email.com', 'pendente'),
 ('Juliana Costa', 'juliana.costa@email.com', 'pago'),
 ('Juliana Costa', 'juliana.costa@email.com', 'pendente'),
 ('Leandro Fonseca', 'leandro.fonseca@email.com', 'pago'),
 ('Luciano Huck', 'luciano_huck@globo.com', 'pago'),
 ('Marcos Rocha', 'marcos.rocha@email.com', 'pago'),
 ('Maria Oliveira', 'maria.oliveira@email.com', 'pago'),
 ('Ricardo Mendes', 'ricardo.mendes@email.com', 'pago'),
 ('Ricardo Mendes', 'ricardo.mendes@email.com', 'pendente')]

## 6. Totalizar Vendas por Categoria
Multiplicar a quantidade x preço dos Itens de Pedidos;
- Relacionar com os Produtos (Categorias);
- Relacionar com as Categorias (Nomes);
- Agrupar por nome de categoria.

In [73]:
%%sql 
select 
    c.nome categoria, sum(i.preco_unitario * i.quantidade) total_por_categoria
    from itens_pedido i
    inner join produtos p on i.id_produto = p.id_produto
    inner join categorias c on p.id_categoria = c.id_categoria
    group by c.nome
    order by 1;

 * postgresql://postgres:***@localhost:5432/banco
9 rows affected.

[('Automotivo', 89.9),
 ('Casa e Decoração', 2018.9),
 ('Educação', 696.0),
 ('Esportes e Lazer', 609.7),
 ('Moda e Vestuário', 1079.7),
 ('Saúde e Bem-Estar', 149.99),
 ('Serviços Financeiros', 299.9),
 ('Tecnologia', 10197.9),
 ('Turismo e Viagens', 3499.0)]

## 7. Listar clientes ativos e inativos

Listar:

- Todos os clientes que fizeram pedidos nos últimos 30 dias.
- Todos os clientes que não fizeram nenhum pedido ainda.
Ou seja, queremos unir clientes ativos e clientes inativos. Retornar:
- id_cliente;
- nome;
- email;
- status (ativo ou inativo)

Dicas: 
- Usar UNION para juntar os 2 conjuntos de dados
- WHERE p.data_pedido >= CURRENT_DATE - INTERVAL '30 days'

In [102]:
%%sql 
select 
    distinct c.id_cliente, c.nome, c.email, 'ativo' as status  
    from clientes c 
    inner join pedidos p on c.id_cliente = p.id_cliente
    where p.data_pedido >= CURRENT_DATE - interval '180 days' 
    -- order by 1
union
select 
    distinct c.id_cliente, c.nome, c.email, 'inativo' as status  
    from clientes c 
    inner join pedidos p on c.id_cliente = p.id_cliente
    where p.data_pedido >= CURRENT_DATE - interval '180 days' 
    -- order by 1
union
select 
    c.id_cliente, c.nome, c.email, 'excluir' as status  
    from clientes c 
    left join pedidos p on c.id_cliente = p.id_cliente
    where p.id_pedido is null
    order by 4, 1;

 * postgresql://postgres:***@localhost:5432/banco
40 rows affected.

[(1, 'João Silva', 'joao.silva@email.com', 'ativo'),
 (2, 'Maria Oliveira', 'maria.oliveira@email.com', 'ativo'),
 (3, 'Carlos Souza', 'carlos.souza@email.com', 'ativo'),
 (4, 'Ana Paula', 'ana.paula@email.com', 'ativo'),
 (5, 'Fernanda Lima', 'fernanda.lima@email.com', 'ativo'),
 (6, 'Ricardo Mendes', 'ricardo.mendes@email.com', 'ativo'),
 (7, 'Juliana Costa', 'juliana.costa@email.com', 'ativo'),
 (8, 'Marcos Rocha', 'marcos.rocha@email.com', 'ativo'),
 (9, 'Beatriz Nunes', 'beatriz.nunes@email.com', 'ativo'),
 (10, 'Eduardo Ferreira', 'eduardo.ferreira@email.com', 'ativo'),
 (12, 'Alice Ribeiro', 'alice.ribeiro@example.com', 'excluir'),
 (13, 'Bruno Souza', 'bruno.souza@example.com', 'excluir'),
 (14, 'Carla Menezes', 'carla.menezes@example.com', 'excluir'),
 (15, 'Daniel Silva', 'daniel.silva@example.com', 'excluir'),
 (16, 'Eduarda Lima', 'eduarda.lima@example.com', 'excluir'),
 (17, 'Felipe Andrade', 'felipe.andrade@example.com', 'excluir'),
 (18, 'Gabriela Torres', 'gabriela.torres@example.com', 'excluir'),
 (19, 'Henrique Castro', 'henrique.castro@example.com', 'excluir'),
 (20, 'Isabela Rocha', 'isabela.rocha@example.com', 'excluir'),
 (21, 'João Pedro', 'joao.pedro@example.com', 'excluir'),
 (22, 'Karen Azevedo', 'karen.azevedo@example.com', 'excluir'),
 (23, 'Leonardo Farias', 'leonardo.farias@example.com', 'excluir'),
 (24, 'Mariana Cunha', 'mariana.cunha@example.com', 'excluir'),
 (25, 'Nicolas Gomes', 'nicolas.gomes@example.com', 'excluir'),
 (26, 'Olívia Nunes', 'olivia.nunes@example.com', 'excluir'),
 (27, 'Paulo Henrique', 'paulo.henrique@example.com', 'excluir'),
 (28, 'Quésia Moraes', 'quesia.moraes@example.com', 'excluir'),
 (29, 'Rafael Martins', 'rafael.martins@example.com', 'excluir'),
 (30, 'Sabrina Lopes', 'sabrina.lopes@example.com', 'excluir'),
 (31, 'Tiago Ferreira', 'tiago.ferreira@example.com', 'excluir'),
 (1, 'João Silva', 'joao.silva@email.com', 'inativo'),
 (2, 'Maria Oliveira', 'maria.oliveira@email.com', 'inativo'),
 (3, 'Carlos Souza', 'carlos.souza@email.com', 'inativo'),
 (4, 'Ana Paula', 'ana.paula@email.com', 'inativo'),
 (5, 'Fernanda Lima', 'fernanda.lima@email.com', 'inativo'),
 (6, 'Ricardo Mendes', 'ricardo.mendes@email.com', 'inativo'),
 (7, 'Juliana Costa', 'juliana.costa@email.com', 'inativo'),
 (8, 'Marcos Rocha', 'marcos.rocha@email.com', 'inativo'),
 (9, 'Beatriz Nunes', 'beatriz.nunes@email.com', 'inativo'),
 (10, 'Eduardo Ferreira', 'eduardo.ferreira@email.com', 'inativo')]